; domain
;; Alexander Shleyfman (shleyfman.alexander@gmail.com) and Ryo Kuroiwa (mhgeoe@gmail.com)
(define (domain delivery)
    (:types
        room item arm bot - object
    )
    (:predicates
        (at-bot ?b - bot ?x - room)
        (at ?i - item ?x - room)
        (door ?x - room ?y - room)
        (free ?a - arm)
        (in-arm ?i - item ?a - arm)
        (in-tray ?i - item ?b - bot)
        (mount ?a - arm ?b - bot)
    )

    (:functions
        (load_limit ?b - bot)
        (current_load ?b - bot)
        (weight ?i - item)
        (cost)
    )

    (:action move
        :parameters (?b - bot ?x - room ?y - room)
        :precondition (and (at-bot ?b ?x)
            (door ?x ?y))
        :effect (and (at-bot ?b ?y)
            (not (at-bot ?b ?x))
            (increase (cost) 3)
        )
    )

    (:action pick
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (at ?i ?x) (at-bot ?b ?x) (free ?a) (mount ?a ?b)
            (<= (+ (current_load ?b) (weight ?i)) (load_limit ?b)))
        :effect (and (in-arm ?i ?a)
            (not (at ?i ?x))
            (not (free ?a))
            (increase (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action drop
        :parameters (?i - item ?x - room ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (at-bot ?b ?x)
            (mount ?a ?b))
        :effect (and (free ?a)
            (at ?i ?x)
            (not (in-arm ?i ?a))
            (decrease (current_load ?b) (weight ?i))
            (increase (cost) 2)
        )
    )

    (:action to-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-arm ?i ?a)
            (mount ?a ?b))
        :effect (and (free ?a)
            (not (in-arm ?i ?a))
            (in-tray ?i ?b)
            (increase (cost) 1)
        )
    )

    (:action from-tray
        :parameters (?i - item ?a - arm ?b - bot)
        :precondition (and (in-tray ?i ?b)
            (mount ?a ?b)
            (free ?a))
        :effect (and (not (free ?a))
            (in-arm ?i ?a)
            (not (in-tray ?i ?b))
            (increase (cost) 1)
        )
    )
)

; problem
(define (problem delivery-x-3)
   (:domain delivery)
   (:objects rooma roomb roomc - room
             item8 item7 item6 item5 item4 item3 item2 item1 - item
             bot1 bot2 - bot
             left1 right1 left2 right2 - arm)
   (:init (= (weight item8) 2)
          (= (weight item7) 2)
          (= (weight item6) 1)
          (= (weight item5) 1)
          (= (weight item4) 2)
          (= (weight item3) 2)
          (= (weight item2) 1)
          (= (weight item1) 1)
          (at item8 rooma)
          (at item7 rooma)
          (at item6 rooma)
          (at item5 rooma)
          (at item4 rooma)
          (at item3 rooma)
          (at item2 rooma)
          (at item1 rooma)

          (at-bot bot1 rooma)
          (at-bot bot2 rooma)
          (free left1)
          (free right1)
          (free left2)
          (free right2)
          (mount left1 bot1)
          (mount right1 bot1)
          (mount left2 bot2)
          (mount right2 bot2)

          (door rooma roomb)
          (door roomb rooma)
          (door rooma roomc)
          (door roomc rooma)

          (= (current_load bot1) 0)
          (= (load_limit bot1) 4)
          (= (current_load bot2) 0)
          (= (load_limit bot2) 4)
          (= (cost) 0))

   (:goal (and (at item8 roomb)
               (at item7 roomb)
               (at item6 roomb)
               (at item5 roomb)
               (at item4 roomc)
               (at item3 roomc)
               (at item2 roomc)
               (at item1 roomc)))

   (:metric minimize (cost))
)

; plan
1. (pick item4 rooma left2 bot2)
   deleted: (at item4 rooma) (free left2)
   added: (in-arm item4 left2)
   changed: (current_load bot2) from 0 to 2, (cost) from 0 to 2
   goals met: 0 of 8
2. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 2 to 5
   goals met: 0 of 8
3. (pick item5 rooma right1 bot1)
   deleted: (at item5 rooma) (free right1)
   added: (in-arm item5 right1)
   changed: (current_load bot1) from 0 to 1, (cost) from 5 to 7
   goals met: 0 of 8
4. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 7 to 10
   goals met: 0 of 8
5. (drop item5 roomb right1 bot1)
   deleted: (in-arm item5 right1)
   added: (free right1) (at item5 roomb)
   changed: (current_load bot1) from 1 to 0, (cost) from 10 to 12
   goals met: 1 of 8
6. (drop item4 roomc left2 bot2)
   deleted: (in-arm item4 left2)
   added: (free left2) (at item4 roomc)
   changed: (current_load bot2) from 2 to 0, (cost) from 12 to 14
   goals met: 2 of 8
7. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 14 to 17
   goals met: 2 of 8
8. (pick item1 rooma right2 bot2)
   deleted: (at item1 rooma) (free right2)
   added: (in-arm item1 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 17 to 19
   goals met: 2 of 8
9. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 19 to 22
   goals met: 2 of 8
10. (drop item1 roomc right2 bot2)
   deleted: (in-arm item1 right2)
   added: (free right2) (at item1 roomc)
   changed: (current_load bot2) from 1 to 0, (cost) from 22 to 24
   goals met: 3 of 8
11. (move bot2 roomc rooma)
   deleted: (at-bot bot2 roomc)
   added: (at-bot bot2 rooma)
   changed: (cost) from 24 to 27
   goals met: 3 of 8
12. (pick item6 rooma right2 bot2)
   deleted: (at item6 rooma) (free right2)
   added: (in-arm item6 right2)
   changed: (current_load bot2) from 0 to 1, (cost) from 27 to 29
   goals met: 3 of 8
13. (pick item2 rooma left2 bot2)
   deleted: (at item2 rooma) (free left2)
   added: (in-arm item2 left2)
   changed: (current_load bot2) from 1 to 2, (cost) from 29 to 31
   goals met: 3 of 8
14. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 31 to 34
   goals met: 3 of 8
15. (pick item7 rooma right1 bot1)
   deleted: (at item7 rooma) (free right1)
   added: (in-arm item7 right1)
   changed: (current_load bot1) from 0 to 2, (cost) from 34 to 36
   goals met: 3 of 8
16. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 36 to 39
   goals met: 3 of 8
17. (drop item7 roomb right1 bot1)
   deleted: (in-arm item7 right1)
   added: (free right1) (at item7 roomb)
   changed: (current_load bot1) from 2 to 0, (cost) from 39 to 41
   goals met: 4 of 8
18. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 41 to 44
   goals met: 4 of 8
19. (pick item8 rooma right1 bot1)
   deleted: (at item8 rooma) (free right1)
   added: (in-arm item8 right1)
   changed: (current_load bot1) from 0 to 2, (cost) from 44 to 46
   goals met: 4 of 8
20. (move bot1 rooma roomb)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomb)
   changed: (cost) from 46 to 49
   goals met: 4 of 8
21. (drop item8 roomb right1 bot1)
   deleted: (in-arm item8 right1)
   added: (free right1) (at item8 roomb)
   changed: (current_load bot1) from 2 to 0, (cost) from 49 to 51
   goals met: 5 of 8
22. (move bot1 roomb rooma)
   deleted: (at-bot bot1 roomb)
   added: (at-bot bot1 rooma)
   changed: (cost) from 51 to 54
   goals met: 5 of 8
23. (pick item3 rooma right1 bot1)
   deleted: (at item3 rooma) (free right1)
   added: (in-arm item3 right1)
   changed: (current_load bot1) from 0 to 2, (cost) from 54 to 56
   goals met: 5 of 8
24. (move bot1 rooma roomc)
   deleted: (at-bot bot1 rooma)
   added: (at-bot bot1 roomc)
   changed: (cost) from 56 to 59
   goals met: 5 of 8
25. (drop item3 roomc right1 bot1)
   deleted: (in-arm item3 right1)
   added: (free right1) (at item3 roomc)
   changed: (current_load bot1) from 2 to 0, (cost) from 59 to 61
   goals met: 6 of 8
26. (move bot2 rooma roomb)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomb)
   changed: (cost) from 61 to 64
   goals met: 6 of 8
27. (drop item6 roomb right2 bot2)
   deleted: (in-arm item6 right2)
   added: (free right2) (at item6 roomb)
   changed: (current_load bot2) from 2 to 1, (cost) from 64 to 66
   goals met: 7 of 8
28. (move bot2 roomb rooma)
   deleted: (at-bot bot2 roomb)
   added: (at-bot bot2 rooma)
   changed: (cost) from 66 to 69
   goals met: 7 of 8
29. (move bot2 rooma roomc)
   deleted: (at-bot bot2 rooma)
   added: (at-bot bot2 roomc)
   changed: (cost) from 69 to 72
   goals met: 7 of 8
30. (drop item2 roomc left2 bot2)
   deleted: (in-arm item2 left2)
   added: (free left2) (at item2 roomc)
   changed: (current_load bot2) from 1 to 0, (cost) from 72 to 74
   goals met: 8 of 8
